turbulence_sensitivity/komegasst/baseCase/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 2.84;

boundaryField
{
    side
    {
        type            freestream;
        freestreamValue uniform 2.84;
        value           uniform 2.84;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 2.84;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 2.84;
        value           uniform 2.84;
    }
    symmetry
    {
        type            symmetryPlane;
    }
    uav
    {
        type            omegaWallFunction;
        value           uniform 2.84;
    }
}


// ************************************************************************* //
